app/Models/UserModel.php

public function kayit_ol($veri)
{
return $this->insert($veri);
---
INSERT INTO `users` (`kullanici_ad`, `sifre`) VALUES ('yonetici', '$2y$10$TxLFMZq2cw/8SMRFmv2as.lfJKWiTOzoBiuNSFrVhjYsQraYRhUV2')